CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/iostream/src/sl_iostream_eusart.c
/***************************************************************************//**
 * @file
 * @brief IO Stream EUSART Component.
 *******************************************************************************
 * # License
 * <b>Copyright 2019 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(SL_COMPONENT_CATALOG_PRESENT)
#include "sl_component_catalog.h"
#endif

#include "sl_status.h"
#include "sl_slist.h"
#include "sl_iostream.h"
#include "sl_iostream_uart.h"
#include "sli_iostream_uart.h"
#include "sl_iostream_eusart.h"
#include "sl_atomic.h"
#include "sl_clock_manager.h"
#include "em_device.h"
#include "sl_common.h"

#if (_SILICON_LABS_32B_SERIES < 3)
#include "em_eusart.h"
#include "em_gpio.h"
#if !defined(SL_CATALOG_CLOCK_MANAGER_PRESENT)
#include "em_cmu.h"
#endif
#else
#include "sl_peripheral_eusart.h"
#include "sl_peripheral_gpio.h"
#endif

#if (defined(SL_CATALOG_POWER_MANAGER_PRESENT))
#include "sl_power_manager.h"
#endif

#include <string.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

/*******************************************************************************
 *********************************   DEFINES   *********************************
 ******************************************************************************/
// Compatibility layer for sl_peripheral and em lib
#if (_SILICON_LABS_32B_SERIES < 3)
#define GPIO_PIN_MODE_SET       GPIO_PinModeSet
#define GPIO_MODE_PUSH_PULL     gpioModePushPull
#define GPIO_MODE_INPUT_PULL    gpioModeInputPull
#define GPIO_MODE_DISABLED      gpioModeDisabled
#define LDMA_PERIPH             LDMA
#define EUSART_UART_INIT_HF     EUSART_UartInitHf
#define EUSART_UART_INIT_LF     EUSART_UartInitLf
#define EUSART_INT_ENABLE       EUSART_IntEnable
#define EUSART_INT_DISABLE      EUSART_IntDisable
#define EUSART_INT_SET          EUSART_IntSet
#define EUSART_INT_CLEAR        EUSART_IntClear
#define EUSART_STATUS_GET       EUSART_StatusGet
#define EUSART_TX               EUSART_Tx
#define EUSART_ENABLE(eusart)   EUSART_Enable(eusart, eusartEnable)
#define EUSART_DISABLE(eusart)  EUSART_Enable(eusart, eusartDisable)
#define EUSART_HWFC_NONE        eusartHwFlowControlNone
#define EUSART_HWFC_CTS         eusartHwFlowControlCts
#define EUSART_HWFC_RTS         eusartHwFlowControlRts
#define EUSART_HWFC_CTS_RTS     eusartHwFlowControlCtsAndRts
#else
#define GPIO_PIN_MODE_SET       sl_gpio_set_pin_mode
#define GPIO_MODE_PUSH_PULL     SL_GPIO_MODE_PUSH_PULL
#define GPIO_MODE_INPUT_PULL    SL_GPIO_MODE_INPUT_PULL
#define GPIO_MODE_DISABLED      SL_GPIO_MODE_DISABLED
#define LDMA_PERIPH             LDMA0
#define EUSART_UART_INIT_HF     sl_hal_eusart_init_uart_hf
#define EUSART_UART_INIT_LF     sl_hal_eusart_init_uart_lf
#define EUSART_INT_ENABLE       sl_hal_eusart_enable_interrupts
#define EUSART_INT_DISABLE      sl_hal_eusart_disable_interrupts
#define EUSART_INT_SET          sl_hal_eusart_set_interrupts
#define EUSART_INT_CLEAR        sl_hal_eusart_clear_interrupts
#define EUSART_STATUS_GET       sl_hal_eusart_get_status
#define EUSART_TX               sl_hal_eusart_tx
#define EUSART_ENABLE(eusart)        \
  {                                  \
    sl_hal_eusart_enable(eusart);    \
    sl_hal_eusart_enable_tx(eusart); \
    sl_hal_eusart_enable_rx(eusart); \
  }
#define EUSART_DISABLE          sl_hal_eusart_disable
#define EUSART_HWFC_NONE        SL_HAL_EUSART_HW_FLOW_CONTROL_NONE
#define EUSART_HWFC_CTS         SL_HAL_EUSART_HW_FLOW_CONTROL_CTS
#define EUSART_HWFC_RTS         SL_HAL_EUSART_HW_FLOW_CONTROL_RTS
#define EUSART_HWFC_CTS_RTS     SL_HAL_EUSART_HW_FLOW_CONTROL_CTS_RTS
#endif

/*******************************************************************************
 **************************   LOCAL VARIABLES   ********************************
 ******************************************************************************/

#if (defined(SL_CATALOG_POWER_MANAGER_PRESENT))
static sl_power_manager_em_transition_event_handle_t on_power_manager_event_handle;

static void on_power_manager_event(sl_power_manager_em_t from,
                                   sl_power_manager_em_t to);

static sl_power_manager_em_transition_event_info_t on_power_manager_event_info =
{
  .event_mask = (SL_POWER_MANAGER_EVENT_TRANSITION_LEAVING_EM2 | SL_POWER_MANAGER_EVENT_TRANSITION_LEAVING_EM3),
  .on_event = on_power_manager_event,
};

// List of EUSART streams
sl_slist_node_t *eusart_stream_list = NULL;
#endif

/*******************************************************************************
 *********************   LOCAL FUNCTION PROTOTYPES   ***************************
 ******************************************************************************/

static sl_status_t eusart_tx(void *context,
                             char c);

static void eusart_set_next_byte_detect(void *context);

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && !defined(SL_IOSTREAM_UART_FLUSH_TX_BUFFER)
static void eusart_tx_completed(void *context, bool enable);
#endif

