CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/iostream/src/sl_iostream_eusart.c
static sl_status_t eusart_deinit(void *context);

#if (_SILICON_LABS_32B_SERIES >= 3)
static inline sl_hal_eusart_parity_t iostream_to_hal_parity(sl_iostream_eusart_uart_parity_t parity)
{
  switch (parity) {
    case SL_IOSTREAM_EUSART_UART_NO_PARITY:
      return SL_HAL_EUSART_NO_PARITY;
    case SL_IOSTREAM_EUSART_UART_EVEN_PARITY:
      return SL_HAL_EUSART_NO_PARITY;
    case SL_IOSTREAM_EUSART_UART_ODD_PARITY:
      return SL_HAL_EUSART_NO_PARITY;
    default:
      // Unknown parity type
      EFM_ASSERT(false);
      return SL_HAL_EUSART_NO_PARITY;
  }
}

static inline sl_hal_eusart_stop_bits_t iostream_to_hal_stop(sl_iostream_eusart_uart_stop_bits_t stop)
{
  switch (stop) {
    case SL_IOSTREAM_EUSART_UART_STOP_BITS_0P5:
      return SL_HAL_EUSART_STOP_BITS_0P5;
    case SL_IOSTREAM_EUSART_UART_STOP_BITS_1P5:
      return SL_HAL_EUSART_STOP_BITS_1P5;
    case SL_IOSTREAM_EUSART_UART_STOP_BITS_1:
      return SL_HAL_EUSART_STOP_BITS_1;
    case SL_IOSTREAM_EUSART_UART_STOP_BITS_2:
      return SL_HAL_EUSART_STOP_BITS_2;
    default:
      // Unknown stop bit type
      EFM_ASSERT(false);
      return SL_HAL_EUSART_STOP_BITS_1;
  }
}

static inline sl_hal_eusart_hw_flow_control_t iostream_to_hal_flow_control(sl_iostream_eusart_uart_flow_control_t fc)
{
  switch (fc) {
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_SOFT:
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_NONE:
      return SL_HAL_EUSART_HW_FLOW_CONTROL_NONE;
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_CTS:
      return SL_HAL_EUSART_HW_FLOW_CONTROL_CTS;
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_RTS:
      return SL_HAL_EUSART_HW_FLOW_CONTROL_RTS;
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_CTS_RTS:
      return SL_HAL_EUSART_HW_FLOW_CONTROL_CTS_RTS;
    default:
      // Unknown flow control type
      EFM_ASSERT(false);
      return SL_HAL_EUSART_HW_FLOW_CONTROL_NONE;
  }
}

 #else
static inline EUSART_Parity_TypeDef iostream_to_hal_parity(sl_iostream_eusart_uart_parity_t parity)
{
  switch (parity) {
    case SL_IOSTREAM_EUSART_UART_NO_PARITY:
      return eusartNoParity;
    case SL_IOSTREAM_EUSART_UART_EVEN_PARITY:
      return eusartEvenParity;
    case SL_IOSTREAM_EUSART_UART_ODD_PARITY:
      return eusartOddParity;
    default:
      // Unknown parity type
      EFM_ASSERT(false);
      return eusartNoParity;
  }
}

static inline EUSART_Stopbits_TypeDef iostream_to_hal_stop(sl_iostream_eusart_uart_stop_bits_t stop)
{
  switch (stop) {
    case SL_IOSTREAM_EUSART_UART_STOP_BITS_0P5:
      return eusartStopbits0p5;
    case SL_IOSTREAM_EUSART_UART_STOP_BITS_1P5:
      return eusartStopbits1p5;
    case SL_IOSTREAM_EUSART_UART_STOP_BITS_1:
      return eusartStopbits1;
    case SL_IOSTREAM_EUSART_UART_STOP_BITS_2:
      return eusartStopbits2;
    default:
      // Unknown stop bit type
      EFM_ASSERT(false);
      return eusartStopbits1;
  }
}

static inline EUSART_HwFlowControl_TypeDef iostream_to_hal_flow_control(sl_iostream_eusart_uart_flow_control_t fc)
{
  switch (fc) {
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_SOFT:
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_NONE:
      return eusartHwFlowControlNone;
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_CTS:
      return eusartHwFlowControlCts;
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_RTS:
      return eusartHwFlowControlRts;
    case SL_IOSTREAM_EUSART_UART_FLOW_CTRL_CTS_RTS:
      return eusartHwFlowControlCtsAndRts;
    default:
      // Unknown flow control type
      EFM_ASSERT(false);
      return eusartHwFlowControlNone;
  }
}
#if !defined(SL_CATALOG_CLOCK_MANAGER_PRESENT)

#if defined(EUART_COUNT) && (EUART_COUNT > 0)
#define SL_IOSTREAM_EUSART_PERIPHERAL_NAME               EUART_COUNT
#define SL_IOSTREAM_EUSART_CLOCK_REF(periph_nbr)         SL_CONCAT_PASTER_3(cmuClock_, EUART, periph_nbr)
#else
#define SL_IOSTREAM_EUSART_PERIPHERAL_COUNT              EUSART_COUNT
#define SL_IOSTREAM_EUSART_CLOCK_REF(periph_nbr)         SL_CONCAT_PASTER_3(cmuClock_, EUSART, periph_nbr)
#endif

static inline CMU_Clock_TypeDef get_cmu_clock(uint8_t eusart_nbr)
{
  switch (eusart_nbr) {
    case 0:
      return SL_IOSTREAM_EUSART_CLOCK_REF(0);
    #if SL_IOSTREAM_EUSART_PERIPHERAL_COUNT > 1
    case 1:
      return SL_IOSTREAM_EUSART_CLOCK_REF(1);
    #if SL_IOSTREAM_EUSART_PERIPHERAL_COUNT > 2
    case 2:
      return SL_IOSTREAM_EUSART_CLOCK_REF(2);
    #if SL_IOSTREAM_EUSART_PERIPHERAL_COUNT > 3
    case 3:
      return SL_IOSTREAM_EUSART_CLOCK_REF(3);
    #if SL_IOSTREAM_EUSART_PERIPHERAL_COUNT > 4
    case 4:
      return SL_IOSTREAM_EUSART_CLOCK_REF(4);
    #endif // > 4
    #endif // > 3
    #endif // > 2
    #endif // > 1
    default:
      // Invalid EUSART peripheral number
      EFM_ASSERT(false);
      return SL_IOSTREAM_EUSART_CLOCK_REF(0);
  }
}

static inline void init_hf_clocks(sl_iostream_eusart_config_t *eusart_config)
{
  CMU_Clock_TypeDef eusart_clock = get_cmu_clock(eusart_config->eusart_nbr);
  CMU_ClockEnable(eusart_clock, true);
  // Use high frequency clock branch
  #if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_2) \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_7)
  CMU_ClockEnable(cmuClock_EM01GRPACLK, true);
  #if defined(EUART_PRESENT)
  CMU_CLOCK_SELECT_SET(EUART0CLK, EM01GRPACLK);
  #elif defined(EUSART_PRESENT)
  CMU_CLOCK_SELECT_SET(EUSART0CLK, EM01GRPACLK);
  #else
  #error Missing EU(S)ART peripheral
  #endif
  #elif (_SILICON_LABS_32B_SERIES_2_CONFIG >= 3)
  CMU_CLOCK_SELECT_SET(EM01GRPCCLK, HFRCODPLL);
  if (eusart_clock == cmuClock_EUSART0) {
    CMU_CLOCK_SELECT_SET(EUSART0CLK, EM01GRPCCLK);
  }
  #else
  #error Unsupported board configuration
  #endif
}

static inline void init_lf_clocks(sl_iostream_eusart_config_t *eusart_config)
{
  CMU_Clock_TypeDef eusart_clock = get_cmu_clock(eusart_config->eusart_nbr);
  CMU_ClockEnable(eusart_clock, true);
  // Use low frequency clock branch
  #if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_2) \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_7)
  CMU_ClockEnable(cmuClock_EM23GRPACLK, true);
  #if defined(EUART_PRESENT)
  CMU_CLOCK_SELECT_SET(EUART0CLK, EM23GRPACLK);
  #elif defined(EUSART_PRESENT)
  CMU_CLOCK_SELECT_SET(EUSART0CLK, EM23GRPACLK);
  #else
  #error Missing EU(S)ART peripheral
  #endif
  #elif (_SILICON_LABS_32B_SERIES_2_CONFIG >= 3)
  CMU_ClockEnable(cmuClock_LFRCO, true);
  if (eusart_clock == cmuClock_EUSART0) {
    CMU_CLOCK_SELECT_SET(EUSART0CLK, LFRCO);
  }
  #else
  #error Unsupported board configuration
  #endif // _SILICON_LABS_32B_SERIES_2_CONFIG
}
#endif // SL_CATALOG_CLOCK_MANAGER_PRESENT
#endif // _SILICON_LABS_32B_SERIES < 3

