CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/iostream/src/sl_iostream_eusart.c
/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * EUSART Stream init
 ******************************************************************************/
sl_status_t sl_iostream_eusart_init(sl_iostream_uart_t *iostream_uart,
                                    sl_iostream_uart_config_t *uart_config,
                                    sl_iostream_eusart_config_t *eusart_config,
                                    sl_iostream_eusart_context_t *eusart_context)
{
  sl_status_t status;
  uint8_t em_req = 1;
  EUSART_TypeDef* eusart_periph = sl_device_peripheral_eusart_get_base_addr(eusart_config->eusart);

  // Configure EUSART in UART
  #if (_SILICON_LABS_32B_SERIES >= 3)
  sl_hal_eusart_uart_config_t eusart_init = eusart_config->enable_high_frequency
                                            ? (sl_hal_eusart_uart_config_t)SL_HAL_EUSART_UART_INIT_DEFAULT_HF
                                            : (sl_hal_eusart_uart_config_t)SL_HAL_EUSART_UART_INIT_DEFAULT_LF;
  // Advanced Init structure
  sl_hal_eusart_uart_advanced_config_t advanced_init = SL_HAL_EUSART_UART_ADVANCED_INIT_DEFAULT;
  eusart_init.advanced_config = &advanced_init;
  // Compute clock div for baudrate
  uint32_t freq;
  sl_clock_branch_t clock_branch = sl_device_peripheral_get_clock_branch(eusart_config->eusart);
  status = sl_clock_manager_get_clock_branch_frequency(clock_branch, &freq);
  EFM_ASSERT(status == SL_STATUS_OK);

  eusart_init.clock_div = sl_hal_eusart_uart_calculate_clock_div(freq,
                                                                 eusart_config->baudrate,
                                                                 eusart_init.oversampling);
  eusart_init.parity = iostream_to_hal_parity(eusart_config->parity);
  eusart_init.stop_bits = iostream_to_hal_stop(eusart_config->stop_bits);
  eusart_init.advanced_config->dma_wakeup_on_rx = true;
  eusart_init.advanced_config->hw_flow_control_mode = iostream_to_hal_flow_control(eusart_config->flow_control);
  #else
  EUSART_UartInit_TypeDef eusart_init;
  if (eusart_config->enable_high_frequency) {
    eusart_init = (EUSART_UartInit_TypeDef)EUSART_UART_INIT_DEFAULT_HF;

    #if !defined(SL_CATALOG_CLOCK_MANAGER_PRESENT)
    // Legacy clock initialization with em_cmu
    init_hf_clocks(eusart_config);
    #endif // SL_CATALOG_CLOCK_MANAGER_PRESENT
  } else {
    eusart_init = (EUSART_UartInit_TypeDef)EUSART_UART_INIT_DEFAULT_LF;

    #if !defined(SL_CATALOG_CLOCK_MANAGER_PRESENT)
    // Legacy clock initialization with em_cmu
    init_lf_clocks(eusart_config);
    #endif // SL_CATALOG_CLOCK_MANAGER_PRESENT
  }

  EUSART_AdvancedInit_TypeDef advanced_init = EUSART_ADVANCED_INIT_DEFAULT;
  eusart_init.baudrate = eusart_config->baudrate;
  eusart_init.parity = iostream_to_hal_parity(eusart_config->parity);
  eusart_init.stopbits = iostream_to_hal_stop(eusart_config->stop_bits);
  eusart_init.advancedSettings = &advanced_init;
  eusart_init.advancedSettings->dmaWakeUpOnRx = true;
  eusart_init.advancedSettings->hwFlowControl = iostream_to_hal_flow_control(eusart_config->flow_control);
  #endif // _SILICON_LABS_32B_SERIES >= 3

  if (eusart_config->enable_high_frequency) {
    em_req = 1;
  } else {
    em_req = 2;
  }

  status = sli_iostream_uart_context_init(iostream_uart,
                                          &eusart_context->context,
                                          uart_config,
                                          eusart_tx,
#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && !defined(SL_IOSTREAM_UART_FLUSH_TX_BUFFER)
                                          eusart_tx_completed,
#else
                                          NULL,
#endif
                                          eusart_set_next_byte_detect,
                                          eusart_deinit,
                                          em_req,
                                          em_req);
  if (status != SL_STATUS_OK) {
    return status;
  }

  eusart_context->bus_clock = eusart_config->bus_clock;
  eusart_context->rx_pin = eusart_config->rx_pin;
  eusart_context->rx_port = eusart_config->rx_port;
  eusart_context->tx_pin = eusart_config->tx_pin;
  eusart_context->tx_port = eusart_config->tx_port;
  eusart_context->cts_pin = eusart_config->cts_pin;
  eusart_context->cts_port = eusart_config->cts_port;
  eusart_context->rts_pin = eusart_config->rts_pin;
  eusart_context->rts_port = eusart_config->rts_port;
  eusart_context->eusart = eusart_config->eusart;

  // Configure GPIO pins
  sl_clock_manager_enable_bus_clock(SL_BUS_CLOCK_GPIO);

  // Configure TX and RX GPIOs
  GPIO_PIN_MODE_SET(eusart_config->tx_port, eusart_config->tx_pin, GPIO_MODE_PUSH_PULL, 1);
  GPIO_PIN_MODE_SET(eusart_config->rx_port, eusart_config->rx_pin, GPIO_MODE_INPUT_PULL, 1);

  // Configure EUSART for basic async operation
  eusart_context->flags = 0;

  // Configure EUSART peripheral clock
  sl_clock_manager_enable_bus_clock(eusart_config->bus_clock);

  if (eusart_config->enable_high_frequency) {
    EUSART_UART_INIT_HF(eusart_periph, &eusart_init);
    eusart_context->flags |= SLI_IOSTREAM_UART_FLAG_HIGH_FREQUENCY;
  } else {
    EUSART_UART_INIT_LF(eusart_periph, &eusart_init);
  }

  // Setup GPIO pin routing
#if defined(EUART_COUNT) && (EUART_COUNT > 0)
  GPIO->EUARTROUTE->ROUTEEN = GPIO_EUART_ROUTEEN_TXPEN;
  GPIO->EUARTROUTE->TXROUTE = (eusart_config->tx_port << _GPIO_EUART_TXROUTE_PORT_SHIFT)
                              | (eusart_config->tx_pin << _GPIO_EUART_TXROUTE_PIN_SHIFT);
  GPIO->EUARTROUTE->RXROUTE = (eusart_config->rx_port << _GPIO_EUART_RXROUTE_PORT_SHIFT)
                              | (eusart_config->rx_pin << _GPIO_EUART_RXROUTE_PIN_SHIFT);
#else
  GPIO->EUSARTROUTE[eusart_config->port_index].ROUTEEN = GPIO_EUSART_ROUTEEN_TXPEN;
  GPIO->EUSARTROUTE[eusart_config->port_index].TXROUTE =
    (eusart_config->tx_port << _GPIO_EUSART_TXROUTE_PORT_SHIFT)
    | (eusart_config->tx_pin << _GPIO_EUSART_TXROUTE_PIN_SHIFT);
  GPIO->EUSARTROUTE[eusart_config->port_index].RXROUTE =
    (eusart_config->rx_port << _GPIO_EUSART_RXROUTE_PORT_SHIFT)
    | (eusart_config->rx_pin << _GPIO_EUSART_RXROUTE_PIN_SHIFT);
#endif

  // Setup CTS/RTS
  if (eusart_config->flow_control == EUSART_HWFC_CTS
      || eusart_config->flow_control == EUSART_HWFC_CTS_RTS) {
    // Enable CTS pin
    eusart_context->flags |= SLI_IOSTREAM_UART_FLAG_CTS;
    GPIO_PIN_MODE_SET(eusart_config->cts_port, eusart_config->cts_pin, GPIO_MODE_INPUT_PULL, 0);
  }

  if (eusart_config->flow_control == EUSART_HWFC_RTS
      || eusart_config->flow_control == EUSART_HWFC_CTS_RTS) {
    // Enable RTS pin
    eusart_context->flags |= SLI_IOSTREAM_UART_FLAG_RTS;
    GPIO_PIN_MODE_SET(eusart_config->rts_port, eusart_config->rts_pin, GPIO_MODE_PUSH_PULL, 0);
  }

