CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/iostream/src/sl_iostream_eusart.c
  if (eusart_context->flags & SLI_IOSTREAM_UART_FLAG_CTS) {
#if defined(EUART_COUNT) && (EUART_COUNT > 0)
    GPIO->EUARTROUTE_SET->CTSROUTE = (eusart_config->cts_port << _GPIO_EUART_CTSROUTE_PORT_SHIFT)
                                     | (eusart_config->cts_pin << _GPIO_EUART_CTSROUTE_PIN_SHIFT);
#else
    GPIO->EUSARTROUTE_SET[eusart_config->port_index].CTSROUTE =
      (eusart_config->cts_port << _GPIO_EUSART_CTSROUTE_PORT_SHIFT)
      | (eusart_config->cts_pin << _GPIO_EUSART_CTSROUTE_PIN_SHIFT);
#endif
  }
  if (eusart_context->flags & SLI_IOSTREAM_UART_FLAG_CTS) {
#if defined(EUART_COUNT) && (EUART_COUNT > 0)
    GPIO->EUARTROUTE_SET->ROUTEEN = GPIO_EUART_ROUTEEN_RTSPEN;
    GPIO->EUARTROUTE_SET->RTSROUTE = (eusart_config->rts_port << _GPIO_EUART_RTSROUTE_PORT_SHIFT)
                                     | (eusart_config->rts_pin << _GPIO_EUART_RTSROUTE_PIN_SHIFT);
#else
    GPIO->EUSARTROUTE_SET[eusart_config->port_index].ROUTEEN = GPIO_EUSART_ROUTEEN_RTSPEN;
    GPIO->EUSARTROUTE_SET[eusart_config->port_index].RTSROUTE =
      (eusart_config->rts_port << _GPIO_EUSART_RTSROUTE_PORT_SHIFT)
      | (eusart_config->rts_pin << _GPIO_EUSART_RTSROUTE_PIN_SHIFT);
#endif
  }

  // Finally, enable EUSART peripheral
  EUSART_INT_ENABLE(eusart_periph, EUSART_IF_RXFL);
  EUSART_ENABLE(eusart_periph);

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
  // Subscribe to notification to re-enable eusart after deepsleep.
  if (eusart_stream_list == NULL) {
    sl_power_manager_subscribe_em_transition_event(&on_power_manager_event_handle, &on_power_manager_event_info);
  }
  sl_slist_push(&eusart_stream_list, &eusart_context->node);
#endif

  return SL_STATUS_OK;
}
/**************************************************************************//**
 * @brief EUSART IRQ Handler
 *****************************************************************************/
void sl_iostream_eusart_irq_handler(sl_iostream_uart_t *iostream_uart)
{
  sl_iostream_eusart_context_t *eusart_context = (sl_iostream_eusart_context_t *) iostream_uart->stream.context;
  EUSART_TypeDef* eusart_periph = sl_device_peripheral_eusart_get_base_addr(eusart_context->eusart);
  #if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && !defined(SL_IOSTREAM_UART_FLUSH_TX_BUFFER)
  // Handle Transmit Complete Events
  if (eusart_periph->IF & EUSART_IF_TXC) {
    EUSART_INT_CLEAR(eusart_periph, EUSART_IF_TXC);
    // Check if the Status register has the TXC flag as well since the flag will clean itself
    // if other transmissions are queued contrary to the IF flag
    if ((EUSART_STATUS_GET(eusart_periph) & _EUSART_STATUS_TXC_MASK) != 0) {
      sli_uart_txc(&eusart_context->context);
    }
  }
  #endif

  // Handle RXFL events
  if (eusart_periph->IF & EUSART_IF_RXFL) {
  #if !defined(SL_CATALOG_KERNEL_PRESENT) && defined(SL_CATALOG_POWER_MANAGER_PRESENT)
    // Always wakeup the core up from RX IRQ
    eusart_context->context.sleep = SL_POWER_MANAGER_WAKEUP;
  #endif

    // Clear the IF
    eusart_periph->IF_CLR = EUSART_IF_RXFL;
    // Detected new byte, signal the core
    if (eusart_context->context.rx_data_available == false) {
      // Disable the IRQ until the RX Buffer is emptied, or becomes full
      EUSART_INT_DISABLE(eusart_periph, EUSART_IF_RXFL);
      sl_atomic_store(eusart_context->context.rx_data_available, true);
      #if defined(SL_CATALOG_KERNEL_PRESENT)
      // Unlock the read thread
      if (eusart_context->context.block) {
        if (osSemaphoreGetCount(eusart_context->context.read_signal) == 0) {
          osStatus_t status = osSemaphoreRelease(eusart_context->context.read_signal);
          EFM_ASSERT(status == osOK);
        }
      }
      #endif // SL_CATALOG_KERNEL_PRESENT
      return;
    }

    // Rx Buffer full, check if last byte is control character
    if (eusart_context->context.rx_buffer_full == true) {
      // Check if most recent byte is flow control (we will lose this data)
      if (eusart_context->context.sw_flow_control == true) {
        // Send XOFF to indicate RX buffer is full
        sl_atomic_store(eusart_context->context.remote_xon, false);
        EUSART_TX(eusart_periph, UARTXOFF);

        // Make sure RXFL stays enabled to avoid deadlock if both sides are full
        EUSART_INT_ENABLE(eusart_periph, EUSART_IF_RXFL);

        // Check if received byte is control char
        char dropped_byte;
        dropped_byte = (char)eusart_periph->RXDATA;

        if (dropped_byte == UARTXON) {
          sl_atomic_store(eusart_context->context.xon, true);
        } else if (dropped_byte == UARTXOFF) {
          sl_atomic_store(eusart_context->context.xon, false);
        }

        // Found most recent control character, set the scan pointer to the end of the received data
        if (dropped_byte == UARTXON || dropped_byte == UARTXOFF) {
          eusart_context->context.ctrl_char_scan_ptr = (uint8_t*)LDMA_PERIPH->CH[eusart_context->context.dma.channel].DST - 1;
        }
        // The byte is now lost...
        return;
      }
      // Can reach here if data was available and next byte detect was enabled (e.g. for sleep).
      // Disable RXFL IRQ to avoid looping in IRQ forever.
      EUSART_INT_DISABLE(eusart_periph, EUSART_IF_RXFL);
    }
  }
}

/*******************************************************************************
 **************************   LOCAL FUNCTIONS   ********************************
 ******************************************************************************/
/***************************************************************************//**
 * Internal stream write implementation
 ******************************************************************************/
static sl_status_t eusart_tx(void *context,
                             char c)
{
  sl_iostream_eusart_context_t *eusart_context = (sl_iostream_eusart_context_t *)context;
  EUSART_TypeDef* eusart_periph = sl_device_peripheral_eusart_get_base_addr(eusart_context->eusart);
  EUSART_TX(eusart_periph, c);

#if defined(SL_IOSTREAM_UART_FLUSH_TX_BUFFER)
/* Wait until transmit buffer is empty */
  while (!(EUSART_STATUS_GET(eusart_periph) & EUSART_STATUS_TXC)) ;
#endif

