CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/iostream/src/sl_iostream_eusart.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Enable EUSART Rx Data Valid (RXFL) Interrupt and set the RXFL IF to reflect
 * the current status of the RX FIFO.
 * Make sure the DMA is not running when calling this function.
 ******************************************************************************/
static void eusart_set_next_byte_detect(void *context)
{
  sl_iostream_eusart_context_t *eusart_context = (sl_iostream_eusart_context_t *)context;
  EUSART_TypeDef* eusart_periph = sl_device_peripheral_eusart_get_base_addr(eusart_context->eusart);
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_CRITICAL();
  // Update the IF to reflect the STATUS register (IF is not updated automatically by hardware)
  if (eusart_periph->STATUS & EUSART_STATUS_RXFL) {
    EUSART_INT_SET(eusart_periph, EUSART_IF_RXFL);
  } else {
    EUSART_INT_CLEAR(eusart_periph, EUSART_IF_RXFL);
  }
  // Enable the IRQ handler
  EUSART_INT_ENABLE(eusart_periph, EUSART_IF_RXFL);
  CORE_EXIT_CRITICAL();
}

/***************************************************************************//**
 * EUSART Stream De-init.
 ******************************************************************************/
static sl_status_t eusart_deinit(void *context)
{
  sl_iostream_eusart_context_t *eusart_context = (sl_iostream_eusart_context_t *)context;
  EUSART_TypeDef* eusart_periph = sl_device_peripheral_eusart_get_base_addr(eusart_context->eusart);

  // Wait until transfert is completed
  while (!(EUSART_STATUS_GET(eusart_periph) & EUSART_STATUS_TXFL)) ;

  // De-Configure TX and RX GPIOs
  GPIO_PIN_MODE_SET(eusart_context->tx_port, eusart_context->tx_pin, GPIO_MODE_DISABLED, 0);
  GPIO_PIN_MODE_SET(eusart_context->rx_port, eusart_context->rx_pin, GPIO_MODE_DISABLED, 0);

  // De-Configure Flow Control GPIOs
  if (eusart_context->flags & SLI_IOSTREAM_UART_FLAG_CTS) {
    GPIO_PIN_MODE_SET(eusart_context->cts_port, eusart_context->cts_pin, GPIO_MODE_DISABLED, 0);
  }
  if (eusart_context->flags & SLI_IOSTREAM_UART_FLAG_RTS) {
    GPIO_PIN_MODE_SET(eusart_context->rts_port, eusart_context->rts_pin, GPIO_MODE_DISABLED, 0);
  }

  // Disable EUSART IRQ
  #if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && !defined(SL_IOSTREAM_UART_FLUSH_TX_BUFFER)
  EUSART_INT_DISABLE(eusart_periph, EUSART_IF_TXC);
  #endif
  EUSART_INT_DISABLE(eusart_periph, EUSART_IF_RXFL);

  // Disable EUSART peripheral
  EUSART_DISABLE(eusart_periph);

  // Disable EUSART Clock
  sl_clock_manager_disable_bus_clock(eusart_context->bus_clock);

  #if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
  // Subscribe to notification to re-enable eusart after deepsleep.
  sl_slist_remove(&eusart_stream_list, &eusart_context->node);
  if (eusart_stream_list == NULL) {
    sl_power_manager_unsubscribe_em_transition_event(&on_power_manager_event_handle);
  }
#endif

  return SL_STATUS_OK;
}

#if (defined(SL_CATALOG_POWER_MANAGER_PRESENT))
/***************************************************************************//**
 * Power Manager callback notification for EUSART.
 * It is used to re-enabled EUSART module after deepsleeping.
 ******************************************************************************/
static void on_power_manager_event(sl_power_manager_em_t from,
                                   sl_power_manager_em_t to)
{
  (void)from;

  if (to == SL_POWER_MANAGER_EM1
      || to == SL_POWER_MANAGER_EM0) {
    sl_iostream_eusart_context_t *eusart_context;

    SL_SLIST_FOR_EACH_ENTRY(eusart_stream_list, eusart_context, sl_iostream_eusart_context_t, node) {
      EUSART_TypeDef* eusart_periph = sl_device_peripheral_eusart_get_base_addr(eusart_context->eusart);
      EUSART_ENABLE(eusart_periph);
    }
  }
}
#endif

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && !defined(SL_IOSTREAM_UART_FLUSH_TX_BUFFER)
/***************************************************************************//**
 * Enable/Disable EUSART Tx Complete (TXC) Interrupt
 ******************************************************************************/
static void eusart_tx_completed(void *context, bool enable)
{
  (void)context;
  (void)enable;

  sl_iostream_eusart_context_t *eusart_context = (sl_iostream_eusart_context_t *)context;
  EUSART_TypeDef* eusart_periph = sl_device_peripheral_eusart_get_base_addr(eusart_context->eusart);
  if (enable) {
    EUSART_INT_ENABLE(eusart_periph, EUSART_IF_TXC);
  } else {
    EUSART_INT_DISABLE(eusart_periph, EUSART_IF_TXC);
    EUSART_INT_CLEAR(eusart_periph, EUSART_IF_TXC);
  }
}
#endif
